# Bài tập chương 2

# Tạo 2 bảng student và course

In [1]:
import sqlite3

# Kết nối hoặc tạo cơ sở dữ liệu
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Tạo bảng course
cursor.execute("""
CREATE TABLE IF NOT EXISTS course (
    id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL
)
""")

# Tạo bảng student
cursor.execute("""
CREATE TABLE IF NOT EXISTS student (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    class TEXT NOT NULL,
    course_id INTEGER,
    score REAL,
    FOREIGN KEY (course_id) REFERENCES course(id)
)
""")

# Chèn dữ liệu vào bảng course
courses = [
    (12, "Giai tich"),
    (34, "Thong ke"),
    (26, "Tin hoc")
]
cursor.executemany("INSERT INTO course (id, course_name) VALUES (?, ?)", courses)

# Chèn dữ liệu vào bảng student
students = [
    (1, "Nguyen Minh Hoang", "May Tinh", 12, 6.7),
    (2, "Tran Thi Lan", "Kinh Te", 34, 9.2),
    (3, "Pham Van Nam", "Toan Tin", None, 7.9),
    (4, "Le Thanh Huyen", "Toan Tin", 20, 7.2),
    (5, "Vu Quoc Anh", "May Tinh", 24, 8.0),
    (6, "Dang Thuy Linh", "May Tinh", 24, 5.5),
    (7, "Bui Tien Dung", "Kinh Te", 34, 9.2),
    (8, "Ho Ngoc Mai", "Toan Tin", 20, 8.8),
    (9, "Duong Huu Phuc", "Kinh Te", None, 7.2),
    (10, "Cao Thi Hanh", "May Tinh", None, 7.0)
]
cursor.executemany("INSERT INTO student (student_id, name, class, course_id, score) VALUES (?, ?, ?, ?, ?)", students)

# Lưu thay đổi và đóng kết nối
conn.commit()
conn.close()

print("Database and tables created successfully!")

Database and tables created successfully!

# 1. Hãy kết nối hai bảng trên theo những cách sau: -

## Sử dụng tích Decartes. -

In [2]:
import sqlite3

conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT * FROM student, course;
"""
cursor.execute(query)

print("Tích Descartes:")
for row in cursor.fetchall():
    print(row)

conn.close()

Tích Descartes:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')

## Sử dụng JOIN: INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL OUTER JOIN.

### INNER JOIN

In [3]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student.student_id, student.name, student.class, student.course_id, student.score, course.course_name
FROM student
INNER JOIN course ON student.course_id = course.id;
"""
cursor.execute(query)

print("INNER JOIN:")
for row in cursor.fetchall():
    print(row)

conn.close()

INNER JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')

### LEFT JOIN

In [4]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student.student_id, student.name, student.class, student.course_id, student.score, course.course_name
FROM student
LEFT JOIN course ON student.course_id = course.id;
"""
cursor.execute(query)

print("LEFT JOIN:")
for row in cursor.fetchall():
    print(row)

conn.close()

LEFT JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

### RIGHT JOIN

In [5]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student.student_id, student.name, student.class, student.course_id, student.score, course.course_name
FROM course
LEFT JOIN student ON student.course_id = course.id;
"""
cursor.execute(query)

print("RIGHT JOIN (mô phỏng bằng LEFT JOIN):")
for row in cursor.fetchall():
    print(row)

conn.close()

RIGHT JOIN (mô phỏng bằng LEFT JOIN):
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(None, None, None, None, None, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')

### FULL OUTER JOIN

In [6]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student.student_id, student.name, student.class, student.course_id, student.score, course.course_name
FROM student
LEFT JOIN course ON student.course_id = course.id
UNION
SELECT student.student_id, student.name, student.class, student.course_id, student.score, course.course_name
FROM course
LEFT JOIN student ON student.course_id = course.id;
"""
cursor.execute(query)

print("FULL OUTER JOIN (mô phỏng bằng UNION):")
for row in cursor.fetchall():
    print(row)

conn.close()

FULL OUTER JOIN (mô phỏng bằng UNION):
(None, None, None, None, None, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

# 2. Hãy cập nhật những giá trị course_id còn thiếu trong bảng student bằng câu lệnh SQL, trong đó các giá trị được điền là những giá trị nằm trong bảng course  và loại bỏ những bản ghi tham gia những môn học không tồn tại bảng course. Sau đó hãy cho biết:

In [7]:
import sqlite3
import random

conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Lấy danh sách course_id có trong bảng course
cursor.execute("SELECT id FROM course")
course_ids = [row[0] for row in cursor.fetchall()]

# Cập nhật course_id bị thiếu bằng cách chọn ngẫu nhiên từ danh sách có sẵn
for course_id in course_ids:
    cursor.execute("""
    UPDATE student
    SET course_id = ?
    WHERE course_id IS NULL
    """, (random.choice(course_ids),))

# Xóa sinh viên có course_id không tồn tại trong bảng course
cursor.execute("""
DELETE FROM student
WHERE course_id NOT IN (SELECT id FROM course)
""")

conn.commit()
conn.close()

## a. Tổng số sinh viên, điểm trung bình của từng lớp.

In [8]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT class, COUNT(student_id) AS total_students, AVG(score) AS avg_score
FROM student
GROUP BY class;
"""
cursor.execute(query)

print("Tổng số sinh viên và điểm trung bình của từng lớp:")
for row in cursor.fetchall():
    print(row)

conn.close()

Tổng số sinh viên và điểm trung bình của từng lớp:
('Kinh Te', 3, 8.533333333333333)
('May Tinh', 2, 6.85)
('Toan Tin', 1, 7.9)

## b. Tổng số sinh viên, điểm trung bình của từng môn học.

In [9]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT course.course_name, COUNT(student.student_id) AS total_students, AVG(student.score) AS avg_score
FROM student
JOIN course ON student.course_id = course.id
GROUP BY course.course_name;
"""
cursor.execute(query)

print("Tổng số sinh viên và điểm trung bình của từng môn học:")
for row in cursor.fetchall():
    print(row)

conn.close()

Tổng số sinh viên và điểm trung bình của từng môn học:
('Giai tich', 1, 6.7)
('Thong ke', 5, 8.1)

## c. Phân loại thi đua theo số điểm của từng môn học biết: 
- i. Điểm TB ≥  9.0: Xuất sắc. 
- ii. 6.0 ≤ Điểm TB ≤ 8.9: Tốt. 
- iii. Điểm TB < 6.0: Kém.

In [10]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT course.course_name,
       AVG(student.score) AS avg_score,
       CASE 
           WHEN AVG(student.score) >= 9.0 THEN 'Xuất sắc'
           WHEN AVG(student.score) BETWEEN 6.0 AND 8.9 THEN 'Tốt'
           ELSE 'Kém'
       END AS ranking
FROM student
JOIN course ON student.course_id = course.id
GROUP BY course.course_name;
"""
cursor.execute(query)

print("Phân loại thi đua theo môn học:")
for row in cursor.fetchall():
    print(row)

conn.close()

Phân loại thi đua theo môn học:
('Giai tich', 6.7, 'Tốt')
('Thong ke', 8.1, 'Tốt')

# 3. Hãy xếp hạng sinh viên thông qua:

## - a. Điểm số.

In [11]:
import sqlite3

conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student_id, name, class, course_id, score,
       RANK() OVER (ORDER BY score DESC) AS rank
FROM student;
"""
cursor.execute(query)

print("Xếp hạng sinh viên theo điểm số:")
students = cursor.fetchall()
for row in students[:3]:  # Top 3
    print("Top:", row)
for row in students[-3:]:  # Bottom 3
    print("Bottom:", row)

conn.close()

Xếp hạng sinh viên theo điểm số:
Top: (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
Top: (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 1)
Top: (3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 3)
Bottom: (9, 'Duong Huu Phuc', 'Kinh Te', 34, 7.2, 4)
Bottom: (10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 5)
Bottom: (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 6)

## - b. Điểm số theo lớp học.

In [12]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student_id, name, class, course_id, score,
       RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank
FROM student;
"""
cursor.execute(query)

print("Xếp hạng sinh viên theo lớp:")
students = cursor.fetchall()
for row in students[:3]:  # Top 3
    print("Top:", row)
for row in students[-3:]:  # Bottom 3
    print("Bottom:", row)

conn.close()

Xếp hạng sinh viên theo lớp:
Top: (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
Top: (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 1)
Top: (9, 'Duong Huu Phuc', 'Kinh Te', 34, 7.2, 3)
Bottom: (10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 1)
Bottom: (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 2)
Bottom: (3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 1)

## - c. Điểm số theo mã môn học. 
- và cho biết top 3 sinh viện đạt thứ hạng cao nhất, top 3 sinh viên đạt thứ hạng thấp nhất theo 
từng trường hợp trên.

In [13]:
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

query = """
SELECT student.student_id, student.name, student.class, student.course_id, student.score, course.course_name,
       RANK() OVER (PARTITION BY student.course_id ORDER BY student.score DESC) AS rank
FROM student
JOIN course ON student.course_id = course.id;
"""
cursor.execute(query)

print("Xếp hạng sinh viên theo môn học:")
students = cursor.fetchall()
for row in students[:3]:  # Top 3
    print("Top:", row)
for row in students[-3:]:  # Bottom 3
    print("Bottom:", row)

conn.close()

Xếp hạng sinh viên theo môn học:
Top: (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich', 1)
Top: (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke', 1)
Top: (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke', 1)
Bottom: (3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 'Thong ke', 3)
Bottom: (9, 'Duong Huu Phuc', 'Kinh Te', 34, 7.2, 'Thong ke', 4)
Bottom: (10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 'Thong ke', 5)

# 4. Hãy bổ sung thêm một trường graduation_date có kiểu dữ liệu là DATETIME vào bảng student để xác định thời gian tốt nghiệp của từng bạn, trong đó thời gian tốt nghiệp được xác định bởi thời gian hiện tại cộng với số hạng tương ứng của bạn đó tính theo điểm số.

## 1.Thêm cột graduation_date vào bảng student

In [14]:
import sqlite3

conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Thêm cột mới nếu chưa tồn tại
cursor.execute("ALTER TABLE student ADD COLUMN graduation_date DATETIME;")

conn.commit()
conn.close()

print("Đã thêm cột graduation_date vào bảng student.")

Đã thêm cột graduation_date vào bảng student.

## 2. Cập nhật graduation_date dựa trên thứ hạng điểm số

- Sinh viên có điểm số cao hơn sẽ tốt nghiệp sớm hơn.
- Ngày tốt nghiệp được tính bằng thời gian hiện tại + thứ hạng của sinh viên (tính theo điểm).

In [15]:
import sqlite3
from datetime import datetime, timedelta

conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Lấy danh sách sinh viên theo thứ hạng điểm số
query = """
SELECT student_id, RANK() OVER (ORDER BY score DESC) AS rank FROM student;
"""
cursor.execute(query)
students = cursor.fetchall()

# Cập nhật ngày tốt nghiệp: ngày hiện tại + rank ngày
current_date = datetime.now()

for student_id, rank in students:
    graduation_date = current_date + timedelta(days=rank)  # Cộng số ngày tương ứng với rank
    cursor.execute("UPDATE student SET graduation_date = ? WHERE student_id = ?", (graduation_date, student_id))

conn.commit()
conn.close()

print("Đã cập nhật graduation_date cho từng sinh viên theo thứ hạng điểm số.")

Đã cập nhật graduation_date cho từng sinh viên theo thứ hạng điểm số.